{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence listing recent frontend feature changes and associated files.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of major frontend source files.",
  "frontend/DEPLOYMENT_FIX_NOTE.md": "Notes a deployment failure caused by env variable mismatch in Vite and describes root cause.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme tokens.",
  "frontend/index.html": "Root HTML document mounting the React app and loading main.tsx.",
  "frontend/public/_redirects": "Netlify/Vercel-style rule routing all paths to index.html for SPA behavior.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to index.html.",
  "frontend/src/App.tsx": "Sets up TanStack router and page routes wrapped in SiteLayout.",
  "frontend/src/components/branding/PortfolioDirectLink.tsx": "UI card providing copyable direct site and gallery URLs.",
  "frontend/src/components/branding/QRCodeBlock.tsx": "Renders QR code SVG from matrix data inside a styled card.",
  "frontend/src/components/branding/SectionHeader.tsx": "Simple section header with title and optional subtitle.",
  "frontend/src/components/layout/Footer.tsx": "Footer with branding, quick links, contact info, and social links.",
  "frontend/src/components/layout/Header.tsx": "Renders the site header with logo, navigation links, and social icons, including mobile drawer behavior.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with a header, footer, and main content area using a flex column layout.",
  "frontend/src/components/media/MediaLightbox.tsx": "Displays a fullscreen lightbox for images or videos with a close button and item details.",
  "frontend/src/components/media/MediaStrip.tsx": "Shows a responsive grid of media items with loading states, error handling, and category-based styling.",
  "frontend/src/components/services/ServiceSection.tsx": "Renders a styled service section with description, features list, and a MediaStrip for related media.",
  "frontend/src/content/branding.ts": "Defines logo asset paths and company name branding constants.",
  "frontend/src/content/galleryMedia.ts": "Provides the gallery item interface and a list of categorized image and video media entries.",
  "frontend/src/content/qrMatrix.ts": "Exports a numeric matrix representing a QR code for the contact page.",
  "frontend/src/content/services.ts": "Contains service definitions with descriptions, features, and additional offerings metadata.",
  "frontend/src/content/siteCopy.ts": "Stores company copy including vision, mission, contact info, and slogan variations.",
  "frontend/src/content/socialLinks.ts": "Exports URLs for the company’s social media profiles.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query backend hooks; currently empty.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom color variables, including light and dark themes with gold accents.",
  "frontend/src/lib/publicAsset.ts": "Resolves asset URLs using Vite’s BASE_URL to ensure correct paths across deployments.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with company info, services, and brand tagline options.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details including email, location, and multiple phone numbers.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a filterable media gallery with category tabs, lightbox support, and empty-state messaging.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, navigation buttons, contact info, and a services preview section.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the list of services and displays additional offerings with optional media strips.",
  "frontend/src/pages/VisionMissionPage.tsx": "Shows the company’s vision and mission using two styled card components.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related tooling with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variables, path aliases, dev proxy, and build settings.",
  "project_state.json": "Stores project metadata, existing features, pending requests, and state version info."
}