{
  "backend/main.mo": "Empty Motoko actor with no logic defined.",
  "feature_evidence.json": "Feature evidence report listing three features, related files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Text file providing one-line summaries for major frontend files in the project.",
  "frontend/index.css": "Global Tailwind CSS config defining color tokens, themes, and base styles for light/dark modes.",
  "frontend/index.html": "HTML entry point with root mount element and script loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all routes wrapped in SiteLayout.",
  "frontend/src/components/branding/PortfolioDirectLink.tsx": "Component showing the /gallery URL with copy-to-clipboard button and external link.",
  "frontend/src/components/branding/QRCodeBlock.tsx": "Renders a QR code inside a styled card using a boolean matrix.",
  "frontend/src/components/branding/SectionHeader.tsx": "Simple reusable header component displaying a title and optional subtitle.",
  "frontend/src/components/layout/Footer.tsx": "Footer with branding, quick links, contact details, and social media icons.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, navigation links, social icons, and mobile sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper providing header, main content area, and footer.",
  "frontend/src/components/media/MediaLightbox.tsx": "Displays a modal lightbox for an image or video with close controls and item metadata.",
  "frontend/src/components/media/MediaStrip.tsx": "Shows up to four media items for a category or a placeholder if none exist.",
  "frontend/src/components/services/ServiceSection.tsx": "Renders a service card with title, description, features, and related media strip.",
  "frontend/src/content/branding.ts": "Exports centralized branding assets including logo info and company names.",
  "frontend/src/content/galleryMedia.ts": "Defines the GalleryItem type and a list of categorized image media entries.",
  "frontend/src/content/qrMatrix.ts": "Provides a hardcoded QR code matrix for a contact URL.",
  "frontend/src/content/services.ts": "Contains service definitions with descriptions and features plus additional offerings.",
  "frontend/src/content/siteCopy.ts": "Exports site copy including company tagline, vision, mission, and contact info.",
  "frontend/src/content/socialLinks.ts": "Provides social media profile URLs for the company.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth state, login, logout, and context provision.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend query hooks.",
  "frontend/src/index.css": "Tailwind base/theme definitions including color variables and utility classes.",
  "frontend/src/main.tsx": "Initializes the app root with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company introduction, services list, and descriptive text inside styled components.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details including email, location, and phone numbers using cards and icons.",
  "frontend/src/pages/GalleryPage.tsx": "Provides a filterable media gallery with tabs, lightbox support, and empty-state handling for each category.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, navigation buttons, contact summary, QR code block, and service previews.",
  "frontend/src/pages/ServicesPage.tsx": "Shows all services using ServiceSection components and includes an additional offerings grid.",
  "frontend/src/pages/VisionMissionPage.tsx": "Presents the company’s vision and mission in two styled cards with icons.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Defines the current state of the SAQ portfolio website project, including architecture decisions, branding requirements, known build issues, and pending rebuild request. Lists extensive image-cleaning tasks required for the gallery."
}