{
  "backend/main.mo": "Minimal Motoko actor with no functions.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries for various frontend source files.",
  "frontend/DEPLOYMENT_FIX_NOTE.md": "Notes describing a frontend deployment failure caused by environment variable usage in Vite.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry loading fonts and bootstrapping the React app.",
  "frontend/public/_redirects": "Redirect rule routing all SPA paths to index.html.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to index.html.",
  "frontend/src/App.tsx": "Root React router configuration mapping routes to pages within SiteLayout.",
  "frontend/src/components/branding/PortfolioDirectLink.tsx": "Component showing site and portfolio URLs with copy‑to‑clipboard actions.",
  "frontend/src/components/branding/QRCodeBlock.tsx": "Component rendering a QR code using an SVG built from a matrix.",
  "frontend/src/components/branding/SectionHeader.tsx": "Simple section header with title and optional subtitle.",
  "frontend/src/components/layout/Footer.tsx": "Footer with branding, quick links, contact info, and social links using wood‑themed styling.",
  "frontend/src/components/layout/Header.tsx": "Navigation header with logo, desktop/mobile menus, and social links using router navigation and a state-managed sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper that sets a dynamic wood background and renders the header, main content, and footer.",
  "frontend/src/components/media/MediaLightbox.tsx": "Lightbox dialog for viewing gallery images or videos with close controls and item metadata.",
  "frontend/src/components/media/MediaStrip.tsx": "Category-based media grid with loading states, error handling, and optional layout variations for majlis items.",
  "frontend/src/components/services/ServiceSection.tsx": "Service detail section displaying title, description, features, and a related MediaStrip with style variations.",
  "frontend/src/content/branding.ts": "Defines logo asset paths and company name branding constants.",
  "frontend/src/content/galleryMedia.ts": "Exports structured gallery item data for images and videos grouped by category.",
  "frontend/src/content/qrMatrix.ts": "Provides a static 2D matrix representing a QR code for the contact page.",
  "frontend/src/content/services.ts": "Defines service descriptions, features, and additional offerings used across service sections.",
  "frontend/src/content/siteCopy.ts": "Contains site-wide text content including company details, vision, mission, slogans, and contact info.",
  "frontend/src/content/socialLinks.ts": "Stores external social media link URLs for use in components.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, status, and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend React Query hooks.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, typography, and background effects.",
  "frontend/src/lib/publicAsset.ts": "Resolves asset URLs using Vite's BASE_URL to ensure correct paths across deployments.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders company information, services, and a list of branding taglines.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact methods, location, and phone numbers using UI components.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a filterable media gallery with categories, lightbox support, and empty-state messaging.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage layout with a hero section, navigation buttons, contact info, and a QR code block using styled components.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the services page, listing core services and additional offerings with optional media strips.",
  "frontend/src/pages/VisionMissionPage.tsx": "Displays the company’s vision and mission in two styled card sections.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, shadows, container settings, and plugins.",
  "frontend/tsconfig.node.json": "Sets TypeScript options for Node-related builds, including module resolution and composite settings.",
  "frontend/vite.config.ts": "Defines Vite setup with React, environment variable handling, aliases, dev server proxying, and build settings.",
  "project_state.json": "Stores project metadata, feature requirements, and background-image update goals for the redesign."
}