{
  "backend/main.mo": "Empty Motoko actor representing a placeholder backend canister.",
  "feature_evidence.json": "Structured report mapping implemented features to source files, components, and tests for build verification.",
  "frontend-file-summaries.txt": "Text file containing concise summaries of all frontend source files for reference.",
  "frontend/index.css": "Global Tailwind-based style sheet defining color tokens, dark mode variables, and base styling.",
  "frontend/index.html": "Base HTML file bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps all pages in the SiteLayout component.",
  "frontend/src/components/branding/QRCodeBlock.tsx": "Renders a QR code using an SVG matrix inside a styled card.",
  "frontend/src/components/branding/SectionHeader.tsx": "Simple reusable component for page and section headers with optional subtitle.",
  "frontend/src/components/layout/Footer.tsx": "Footer with brand info, navigation links, contact details, social links, and dynamic year.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, navigation, mobile sheet menu, and social icons.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides page layout structure with header, main content area, and footer.",
  "frontend/src/components/media/MediaLightbox.tsx": "Displays a modal lightbox showing a selected image or video with title and category info.",
  "frontend/src/components/media/MediaStrip.tsx": "Renders up to four media items for a given category or a placeholder message if none exist.",
  "frontend/src/components/services/ServiceSection.tsx": "Shows a service card with title, description, features, and a related MediaStrip.",
  "frontend/src/content/galleryMedia.ts": "Defines the GalleryItem type and exports an empty media list for gallery content.",
  "frontend/src/content/qrMatrix.ts": "Exports a static numeric matrix representing a QR code.",
  "frontend/src/content/services.ts": "Defines service data and additional offerings for the services section.",
  "frontend/src/content/siteCopy.ts": "Provides company branding text and contact information.",
  "frontend/src/content/socialLinks.ts": "Contains social media profile URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refetching on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth handling, providing login, logout, and identity state via context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend React Query hooks.",
  "frontend/src/index.css": "Tailwind setup with custom color variables, themes, and utility classes including gold accents.",
  "frontend/src/main.tsx": "Initializes the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the company's offerings and mission.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact methods including email, location, and phone numbers in styled cards.",
  "frontend/src/pages/GalleryPage.tsx": "Displays filterable gallery of images and videos by category and shows selected items in a lightbox.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, navigation buttons, contact info, and early services preview.",
  "frontend/src/pages/ServicesPage.tsx": "Shows all main service sections and a grid of additional offerings using shared service data.",
  "frontend/src/pages/VisionMissionPage.tsx": "Presents the company’s vision and mission in two styled card components.",
  "frontend/tailwind.config.js": "Configures Tailwind theme with custom colors, fonts, animations, and component styling extensions.",
  "project_state.json": "Tracks project metadata, requirements, features, image needs, and architectural notes for the website build."
}