{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report stub containing an empty features array.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend components, pages, content modules, and assets.",
  "frontend/index.css": "Global Tailwind CSS setup defining color tokens, dark mode variables, and base element styles.",
  "frontend/index.html": "HTML entry point providing root div and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps all pages with SiteLayout.",
  "frontend/src/components/branding/PortfolioDirectLink.tsx": "Card component showing a shareable /gallery link with copy‑to‑clipboard support.",
  "frontend/src/components/branding/QRCodeBlock.tsx": "Renders a QR code from a matrix inside a styled card for contact scanning.",
  "frontend/src/components/branding/SectionHeader.tsx": "Simple reusable section header with title and optional subtitle.",
  "frontend/src/components/layout/Footer.tsx": "Footer with logo, quick links, contact info, and social media buttons.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, navigation links, social icons, and mobile menu sheet.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper including Header, Footer, and a main content outlet.",
  "frontend/src/components/media/MediaLightbox.tsx": "Dialog lightbox for viewing full-size images or videos with metadata.",
  "frontend/src/components/media/MediaStrip.tsx": "Displays up to four gallery items for a category or a placeholder if none exist.",
  "frontend/src/components/services/ServiceSection.tsx": "Renders a service section card with title, description, features list, and a media strip based on the service ID.",
  "frontend/src/content/branding.ts": "Defines centralized branding assets including logo path and company name variants.",
  "frontend/src/content/galleryMedia.ts": "Exports a list of gallery media items with metadata for images and videos grouped by category.",
  "frontend/src/content/qrMatrix.ts": "Provides a static numeric matrix representing a QR code for a contact page URL.",
  "frontend/src/content/services.ts": "Defines the Service interface and a list of service offerings with descriptions and features, plus additional offerings.",
  "frontend/src/content/siteCopy.ts": "Contains site copy such as company name, mission, vision, and contact information.",
  "frontend/src/content/socialLinks.ts": "Exports social media profile URLs for Instagram, TikTok, and Snapchat.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook handling login, identity persistence, and status management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for backend-related React Query hooks with no current implementation.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, dark mode theming, and utility classes including gold accents.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with company information, service overview, and styled content using cards and section headers.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with email, location, and phone sections using cards and site copy data.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a filterable media gallery with category tabs, lightbox support, and empty states when no media exists.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage with a hero section, navigation buttons, contact summary, QR block, and a services preview.",
  "frontend/src/pages/ServicesPage.tsx": "Shows all services using ServiceSection components and lists additional offerings in a styled card section.",
  "frontend/src/pages/VisionMissionPage.tsx": "Presents the company’s vision and mission in two styled cards using siteCopy content.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugin integrations.",
  "project_state.json": "Stores project state, architecture notes, known issues, and implemented feature records for the SAQ website."
}