{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend source files for reference.",
  "frontend/DEPLOYMENT_FIX_NOTE.md": "Explains a frontend deployment failure caused by environment variable misuse in Vite.",
  "frontend/index.css": "Tailwind CSS entry file defining custom CSS variables and global theming for light and dark modes.",
  "frontend/index.html": "Base HTML template loading the React app via main.tsx.",
  "frontend/public/_redirects": "Redirect configuration routing all paths to index.html for SPA hosting.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to index.html.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps pages in SiteLayout.",
  "frontend/src/components/branding/PortfolioDirectLink.tsx": "UI component providing copyable links to the live site and gallery.",
  "frontend/src/components/branding/QRCodeBlock.tsx": "Renders a QR code from a matrix inside a styled card.",
  "frontend/src/components/branding/SectionHeader.tsx": "Simple section header with title and optional subtitle.",
  "frontend/src/components/layout/Footer.tsx": "Footer with brand info, quick links, contact details, and social links.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with logo, navigation, and social links, including mobile drawer behavior.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with a consistent layout including header, main content area, and footer.",
  "frontend/src/components/media/MediaLightbox.tsx": "Modal lightbox for viewing gallery images or videos with close controls and metadata.",
  "frontend/src/components/media/MediaStrip.tsx": "Renders a grid of gallery media with loading states, error handling, and category-based styling.",
  "frontend/src/components/services/ServiceSection.tsx": "Displays a service card with description, features, and a related media strip, with special styling for certain services.",
  "frontend/src/content/branding.ts": "Defines centralized branding assets including logo and company name fields.",
  "frontend/src/content/galleryMedia.ts": "Exports gallery media metadata describing images and videos grouped by category.",
  "frontend/src/content/qrMatrix.ts": "Provides a QR code matrix represented as a 2D array of numbers.",
  "frontend/src/content/services.ts": "Defines service metadata, feature lists, and additional offerings used across the site.",
  "frontend/src/content/siteCopy.ts": "Contains site-wide copy such as taglines, mission, contact info, and slogan variations.",
  "frontend/src/content/socialLinks.ts": "Stores URLs for the brand’s social media profiles.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication and exposing login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend‑related React Query hooks.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, dark mode variants, and utility classes including gold‑themed accents.",
  "frontend/src/lib/publicAsset.ts": "Resolves asset URLs using Vite’s BASE_URL to ensure correct paths in different deployment environments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company information, services summary, and themed tagline options.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information including email, location, and phone numbers using styled UI components.",
  "frontend/src/pages/GalleryPage.tsx": "Provides a filterable media gallery with category tabs, lightbox support, and dynamic loading of images and videos.",
  "frontend/src/pages/HomePage.tsx": "Home page layout with hero section, navigation buttons, contact info, and service preview using various UI components.",
  "frontend/src/pages/ServicesPage.tsx": "Renders a services list plus an additional offerings section with media support and structured cards.",
  "frontend/src/pages/VisionMissionPage.tsx": "Displays the company’s vision and mission in two styled cards with icons and header.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, utilities, and plugin integrations.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-specific compilation settings, including ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite setup with React plugin, environment variable handling, dev proxy, build settings, and path aliases.",
  "project_state.json": "Project metadata describing features, pending requests, and image requirements for the parquet flooring updates."
}