{
  "kind": "build_request",
  "title": "Apply Vertical Blinds gallery/media setup to Parquet Flooring service",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new generated static image asset for the Parquet Flooring service and place it under frontend/public/assets/generated with the exact filename specified in the image requirements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "nice.. now add this to parquet flooring service"
        ]
      },
      "acceptanceCriteria": [
        "A new image file exists at frontend/public/assets/generated/parquet-flooring-001.dim_1600x1200.jpg.",
        "The app can load the image via the existing public asset loading approach (served from the frontend public directory)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a new gallery media item for the Parquet Flooring category so it can be rendered by the existing MediaStrip component.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "nice.. now add this to parquet flooring service"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/content/galleryMedia.ts includes at least one new GalleryItem with category set to \"parquet-flooring\".",
        "The new GalleryItem references the generated parquet flooring image path \"assets/generated/parquet-flooring-001.dim_1600x1200.jpg\".",
        "The GalleryItem id is unique within galleryMedia."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Enable media rendering for the Parquet Flooring entry in the Services page \"Additional Offerings\" section by wiring it to the Parquet Flooring media category.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "nice.. now add this to parquet flooring service"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/content/services.ts sets the Parquet Flooring additionalOfferings entry mediaCategory to \"parquet-flooring\".",
        "On the Services page, the Parquet Flooring card in Additional Offerings renders a MediaStrip and displays the parquet flooring media item(s)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "No backend/canister changes.",
    "No new routing/pages beyond wiring Parquet Flooring media into existing Services page sections."
  ],
  "imageRequirements": {
    "required": [
      "Parquet flooring in a bright modern interior photo (parquet-flooring-001.dim_1600x1200.jpg)"
    ],
    "edits": []
  }
}