{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Wire Parquet Flooring media into existing Services gallery system",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add the generated Parquet Flooring static image asset to the public generated assets directory.",
      "acceptanceCriteria": [
        "A new image file exists at frontend/public/assets/generated/parquet-flooring-001.dim_1600x1200.jpg.",
        "The app can load the image via the existing public asset loading approach (served from the frontend public directory)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/parquet-flooring-001.dim_1600x1200.jpg",
          "operation": "create",
          "description": "Add the generated image asset for Parquet Flooring exactly at frontend/public/assets/generated/parquet-flooring-001.dim_1600x1200.jpg so it is served as a static public asset."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a Parquet Flooring gallery item so MediaStrip can render it by category.",
      "acceptanceCriteria": [
        "frontend/src/content/galleryMedia.ts includes at least one new GalleryItem with category set to \"parquet-flooring\".",
        "The new GalleryItem references the generated parquet flooring image path \"assets/generated/parquet-flooring-001.dim_1600x1200.jpg\".",
        "The GalleryItem id is unique within galleryMedia."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/galleryMedia.ts",
          "operation": "modify",
          "description": "Append a new GalleryItem entry for the \"parquet-flooring\" category with a unique id (e.g., \"parquet-flooring-001\"), type \"image\", an appropriate title, and path set to \"assets/generated/parquet-flooring-001.dim_1600x1200.jpg\" so the existing MediaStrip component can resolve and render it via publicAsset()."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Wire the Parquet Flooring Additional Offerings card to the Parquet Flooring media category so it renders a MediaStrip on the Services page.",
      "acceptanceCriteria": [
        "frontend/src/content/services.ts sets the Parquet Flooring additionalOfferings entry mediaCategory to \"parquet-flooring\".",
        "On the Services page, the Parquet Flooring card in Additional Offerings renders a MediaStrip and displays the parquet flooring media item(s)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/services.ts",
          "operation": "modify",
          "description": "Update the \"Parquet Flooring\" entry in additionalOfferings to include mediaCategory: \"parquet-flooring\" so the existing Services page logic conditionally renders MediaStrip for that card."
        }
      ]
    }
  ]
}